# ViewShowMassing Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ViewShowMassing Property
ParameterTypeId Class See Also
---
"Show Mass"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ViewShowMassing { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ViewShowMassing As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ViewShowMassing {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace